{"scoring":null,"notes":"","legend":"Cross-stitch is a form of needlework known since prehistoric times. A cross-stitch pattern consists of several crosses on the face of the fabric, that are connected on the backside. Traditionally, the whole pattern should be embroidered by one thread.\r\n\r\nCarol is going to mass-produce cross-stitch patterns. Each pattern will be accompanied by the rectangular patch of fabric and the thread that is required to embroider this pattern. Carol wants to minimize the length of the thread that is required for the pattern.\\\\\r\n\\centerline{\\includegraphics{cross-stitch-1.ps}}\\\\\r\nYou are given the face of the pattern. You should design the backside, so that the total length of the thread is minimal. The crosses on the pattern's face are 8-connected, i.e. it is possible to reach each cross from any other by a sequence of chess king's moves.","authorLogin":"kgeorgiy","language":"english","timeLimit":2000,"output":"The first line of output should contain the single integer $n$~--- the number of stitches required to embroider the pattern. \r\n\r\nThe following $n + 1$ lines should contain the coordinates of the points where a needle comes from the backside to the face or back: $x_i$, $y_i$ for $i=0..n$. The upper-left corner of the patch has coordinates $(0, 0)$, and the bottom-right one~--- $(w, h)$. The first stitch goes to the face of the pattern, the second one~--- to the backside, the third one~--- to the face, and so on. It is possible to duplicate stitches at the backside, but not at the face. None of the stitches should have zero length.","inputFile":"stdin","outputFile":"stdout","input":"The first line of the input contains two integers $w$ and $h$~--- the width and the height of the patch of fabric ($1 \\le w, h \\le 100$).\r\n\r\nThe following $h$ lines contain the face of the pattern. Each of them contains $w$ characters, where `\\texttt{X}' represents a cross, and `\\texttt{.}'~--- an empty space. The face of the pattern contains at least one cross and crosses are 8-connected.","authorName":"Georgiy Korneev","sampleTests":[{"output":"11\r\n1 1\r\n2 0\r\n2 1\r\n3 0\r\n2 0\r\n3 1\r\n2 1\r\n3 2\r\n2 2\r\n3 1\r\n2 1\r\n1 0\r\n","input":"3 2\r\n.XX\r\n..X\r\n","inputFile":"example.01","outputFile":"example.01.a"}],"name":"Cross-Stitch","interaction":null,"memoryLimit":536870912,"tutorial":"{\r\n    \\parindent=1cm\r\n    \\begin{tabular}{l@{\\extracolsep{1cm}}l}\r\n         Idea: & Georgiy Korneev\\\\\r\n         Statement: & Georgiy Korneev\\\\\r\n         Checker: & Georgiy Korneev\\\\\r\n         Tests: & Georgiy Korneev\\\\\r\n     \\end{tabular}\r\n}\r\n\r\n{\r\n    \\parindent=1cm\r\n    \\begin{tabular}{l@{\\extracolsep{1cm}}l}\r\n         Идея задачи: & Георгий Корнеев\\\\\r\n         Условие: & Георгий Корнеев\\\\\r\n         Проверяющая программа: & Георгий Корнеев\\\\\r\n         Тесты: & Георгий Корнеев\\\\\r\n     \\end{tabular}\r\n}\r\n\r\nВ этой задаче необходимо составить схему вышивки крестом заданного узора, требующую нить минимальной длины.\r\n\r\nЗаменим в узоре каждый крест на <<бабочку>> из двух лицевых и двух изнаночных стежков, как показано на схеме:\r\n\r\n\\begin{center}\r\n\\includegraphics{cross-stitch-2.ps}\r\n\\end{center}\r\n\r\nВ результате замены между соседними по горизонтали крестами могут возникнуть кратные ребра, которые надо будет аккуратно обработать в решении.\r\n\r\nЗаметим, что если два креста были соседями по вертикали, горизонтали или диагонали, то у соответствующих им бабочек есть общая вершина. Так как исходное множество крестов 8-связно, то построенный граф так же будет связным.\r\n\r\nВ построенном графе, число лицевых ребер (стежков), входящих в каждую вершину равно числу изнаночных ребер выходящих из него, и наоборот. Таким образом, алгоритмом аналогичным поиску эйлерова цикла в этом графе можно построить цикл, проходящий по всем ребрам, в котором лицевые и изнаночные ребра чередуются. Разорвем этом цикл по произвольному изнаночному ребру и получим путь из $n$ лицевых и $n-1$ изнаночного стежка. Так как меньше чем $n-1$ изнаночных стежков сделать нельзя, и каждый такой стежок должен иметь длину не меньше 1, то длина построенного пути минимальна.\r\n\r\nТак как построенный граф имеет $O(n^2)$ вершин и ребер, то искомый путь в нем можно найти, затратив $O(n^2)$ времени и памяти."}